#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьЗадачи() Экспорт
	
	СписокЗадач = Новый Массив;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Требования.Владелец.Код = ""НДФЛ_Агент_Уплата""
	|			ТОГДА ""Зарплата""
	|		КОГДА Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|			ТОГДА ""Уплата налога""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТипЗадачи,
	|	ЗадачиБухгалтераПереопределяемый.Организация КАК Организация,
	|	ЕСТЬNULL(Организации.Наименование, """") КАК ОрганизацияНаименование,
	|	ЗадачиБухгалтераПереопределяемый.ПериодСобытия КАК ПериодСобытия,
	|	ВЫБОР
	|		КОГДА ДокументыРеализацииПолномочийНалоговыхОрганов.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ТребованиеФНС)
	|		КОГДА ТранспортноеСообщение.Ссылка ЕСТЬ НЕ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ТребованиеФНС)
	|		ИНАЧЕ ЕСТЬNULL(Требования.Действие, ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ПустаяСсылка))
	|	КОНЕЦ КАК Действие,
	|	ЗадачиБухгалтераПереопределяемый.Срок КАК Срок,
	|	ВЫБОР
	|		КОГДА Требования.Ссылка ЕСТЬ NULL
	|		И ТранспортноеСообщение.Ссылка ЕСТЬ NULL
	|		И ДокументыРеализацииПолномочийНалоговыхОрганов.Ссылка ЕСТЬ NULL
	|			ТОГДА 999
	|		ИНАЧЕ РАЗНОСТЬДАТ(&ТекущаяДата, ЗадачиБухгалтераПереопределяемый.Срок, ДЕНЬ)
	|	КОНЕЦ КАК ОсталосьДней,
	|	ЗадачиБухгалтераПереопределяемый.НачалоВыполнения КАК НачалоВыполнения,
	|	ЗадачиБухгалтераПереопределяемый.Наименование КАК Наименование,
	|	ЗадачиБухгалтераПереопределяемый.Периодичность КАК Периодичность,
	|	ЗадачиБухгалтераПереопределяемый.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтераПереопределяемый
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Требования
	|		ПО ЗадачиБухгалтераПереопределяемый.Правило = Требования.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ЗадачиНачалаРаботы КАК ЗадачиНачалаРаботы
	|		ПО ЗадачиБухгалтераПереопределяемый.Правило = ЗадачиНачалаРаботы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов КАК
	|			ДокументыРеализацииПолномочийНалоговыхОрганов
	|		ПО ЗадачиБухгалтераПереопределяемый.Правило = ДокументыРеализацииПолномочийНалоговыхОрганов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортноеСообщение КАК ТранспортноеСообщение
	|		ПО ЗадачиБухгалтераПереопределяемый.Правило = ТранспортноеСообщение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЗадачиБухгалтераПереопределяемый.Организация = Организации.Ссылка
	|ГДЕ
	|	НЕ ЗадачиБухгалтераПереопределяемый.ВАрхиве
	|	И НЕ ЕСТЬNULL(Требования.ВыполняетсяЕдинымПомощником, ЛОЖЬ)
	|{ГДЕ
	|	ЕСТЬNULL(ЗадачиНачалаРаботы.Ссылка, ЗНАЧЕНИЕ(Перечисление.ЗадачиНачалаРаботы.ПустаяСсылка)) КАК ЗадачаНачалаРаботы}
	|
	|УПОРЯДОЧИТЬ ПО
	|	Срок УБЫВ";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	Запрос.Текст = ТекстЗапроса;

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Структура = Новый Структура;
		Структура.Вставить("TaskType", Строка(ВыборкаДетальныеЗаписи.ТипЗадачи));
		Структура.Вставить("TaskName", ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("Deadline", ВыборкаДетальныеЗаписи.Срок);
		Структура.Вставить("OrganizationName", ВыборкаДетальныеЗаписи.ОрганизацияНаименование);
		Структура.Вставить("EventPeriod", ВыборкаДетальныеЗаписи.ПериодСобытия);
		Структура.Вставить("Action", Строка(ВыборкаДетальныеЗаписи.Действие));
		Структура.Вставить("DaysRemaining", ВыборкаДетальныеЗаписи.ОсталосьДней);
		Структура.Вставить("ExecutionStartDate", ВыборкаДетальныеЗаписи.НачалоВыполнения);
		Структура.Вставить("Frequency", Строка(ВыборкаДетальныеЗаписи.Периодичность));
		Структура.Вставить("Status", Строка(ВыборкаДетальныеЗаписи.Статус));
	
		СписокЗадач.Добавить(Структура);
		
	КонецЦикла;	
		
	JSONСтрока = API_СлужебныйСервер.ПреобразоватьВJSON(СписокЗадач);
	Возврат JSONСтрока;
	
КонецФункции

#КонецОбласти