#Область СлужебныйПрограммныйИнтерфейс

// Возвращает список задач налогового календаря бухгалтера в формате JSON.
//
// Возвращаемое значение:
//   Строка - JSON-строка со списком задач налогового календаря бухгалтера
Функция ПолучитьЗадачи() Экспорт
	
	СписокЗадач = ВнешнийПрограммныйИнтерфейс.ПубликуемыеНалоговыеСобытияКалендаряБухгалтера();
		
	JSONСтрока = API_СлужебныйСервер.ПреобразоватьВJSON(СписокЗадач);
	Возврат JSONСтрока;
	
КонецФункции

Функция ОбновитьПоказателиМонитораРуководителя() Экспорт

	Результат = ВнешнийПрограммныйИнтерфейс.ЗапуститьОбновлениеМонитораДляВнешнегоПрограммногоИнтерфейса();
	
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеДанныеМонитора();
	УстановитьПривилегированныйРежим(Ложь);
	
	JSONСтрока = API_СлужебныйСервер.ПреобразоватьВJSON(ПубликуемыеДанные);
	
	Возврат JSONСтрока;
	
КонецФункции

// Возвращает показатели монитора руководителя в формате JSON для внешнего API.
//
// Возвращаемое значение:
//   Строка - JSON-строка с показателями монитора руководителя
Функция ПоказателиМонитораРуководителя() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеДанные = ВнешнийПрограммныйИнтерфейс.ПубликуемыеДанныеМонитора();
	УстановитьПривилегированныйРежим(Ложь);
	
	JSONСтрока = API_СлужебныйСервер.ПреобразоватьВJSON(ПубликуемыеДанные);
	
	Возврат JSONСтрока;
	
КонецФункции

#КонецОбласти