#Область СлужебныйПрограммныйИнтерфейс

// Создает HTTP-ответ с указанными кодом состояния и телом, устанавливая необходимые заголовки.
//
// Параметры:
//   КодОтвета - Число - код состояния HTTP
//   Данные - Строка - тело ответа в формате JSON
//
// Возвращаемое значение:
//   HTTPСервисОтвет - сформированный HTTP-ответ
Функция Ответ(КодОтвета, Данные = "") Экспорт
	
	Ответ = Новый HTTPСервисОтвет(КодОтвета);
	
	Ответ.Заголовки.Вставить("Accept-Charset", "utf-8");
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	Ответ.Заголовки["Cache-Control"] = "no-cache";
	
	Ответ.УстановитьТелоИзСтроки(Данные);
	
	Возврат Ответ;
	
КонецФункции

// Преобразует переданные данные в строку формата JSON с автоматическим переносом строк и табуляцией.
//
// Параметры:
//   ДанныеДляПреобразования - Произвольный - данные для преобразования в JSON
//
// Возвращаемое значение:
//   Строка - строка в формате JSON
Функция ПреобразоватьВJSON(ДанныеДляПреобразования) Экспорт
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, ДанныеДляПреобразования);
	JSONСтрока = ЗаписьJSON.Закрыть();
	
	Возврат JSONСтрока;
	
КонецФункции

// Преобразует строку с датой в формат даты 1С
//
// Параметры:
//   ВходнаяСтрока - Строка - строка с датой в формате ГГГГ-ММ-ДД или ГГГГММДД
//
// Возвращаемое значение:
//   Дата - преобразованная дата
//   - Неопределено - если входная строка пуста или имеет неверный формат
Функция ПреобразоватьСтрокуВДату1С(ВходнаяСтрока) Экспорт
	
	// Проверяем, что входная строка не пуста
    Если ПустаяСтрока(ВходнаяСтрока) Тогда
        Возврат Неопределено;
    КонецЕсли;

    // Извлекаем дату
    Если СтрНайти(ВходнаяСтрока, "-") <> 0 Тогда
   		 
   		ЧастиДатыМассив = СтрРазделить(ВходнаяСтрока, "-");
    	Если ЧастиДатыМассив.Количество() <> 3 Тогда
        	Возврат Неопределено;
    	КонецЕсли;
    
    	Год = Число(ЧастиДатыМассив[0]);
   		Месяц = Число(ЧастиДатыМассив[1]);
    	День = Число(ЧастиДатыМассив[2]);
         
    ИначеЕсли СтрДлина(ВходнаяСтрока) = 8 Тогда
    	
    	Год = Число(Лев(ВходнаяСтрока, 4));
    	Месяц = Число(Сред(ВходнаяСтрока, 5, 2));
    	День = Число(Сред(ВходнаяСтрока, 7, 2));
    	
    Иначе
    	
    	Возврат Неопределено;
    
    КонецЕсли;

    // Создаём дату 1С
    Дата1С = Дата(Год, Месяц, День);

    Возврат Дата1С;
КонецФункции

// Разделяет строку параметров на массив значений по разделителю ","
//
// Параметры:
//   СтрокаПараметров - Строка, Неопределено - строка с параметрами, разделенными запятой
//
// Возвращаемое значение:
//   Массив из Строка - массив параметров, полученных из исходной строки
Функция СтрокаПараметровВМассив(СтрокаПараметров) Экспорт
	
	Если СтрокаПараметров = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Массив = СтрРазделить(СтрокаПараметров, ",");
	
	Возврат Массив;
	
КонецФункции

// Преобразует строковое представление типов складов в массив значений перечисления
//
// Параметры:
//   СтрокаТипы - Строка, Неопределено - строка с названиями типов складов для фильтрации
//
// Возвращаемое значение:
//   Массив из ПеречислениеСсылка.ТипыСкладов - массив типов складов
Функция СтрокаТиповСкладовВМассив(СтрокаТипы) Экспорт
	
	СписокТипов = Новый Массив;
	
	Если СтрокаТипы = Неопределено Тогда
		СписокТипов.Добавить(Перечисления.ТипыСкладов.ОптовыйСклад);
		СписокТипов.Добавить(Перечисления.ТипыСкладов.РозничныйМагазин);	
		СписокТипов.Добавить(Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка);
		Возврат СписокТипов;
	КонецЕсли;
	
	Если СтрНайти(СтрокаТипы, "Оптовый склад") > 0 Тогда
		СписокТипов.Добавить(Перечисления.ТипыСкладов.ОптовыйСклад);
	КонецЕсли;
	
	Если СтрНайти(СтрокаТипы, "Розничный магазин") > 0 Тогда
		СписокТипов.Добавить(Перечисления.ТипыСкладов.РозничныйМагазин);
	КонецЕсли;
	
	Если СтрНайти(СтрокаТипы, "Неавтоматизированная торговая точка") > 0 Тогда
		СписокТипов.Добавить(Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка);
	КонецЕсли;
	
	Возврат СписокТипов;
	
КонецФункции

#КонецОбласти




