#Область ОбработчикиСобытий

#Область Счета

Функция ПолучениеСпискаСчетовПолучить(Запрос)
	
	Попытка
		JSONСтрока = API_Счета.ПолучитьСчета();
		Ответ = API_СлужебныйСервер.Ответ(200, JSONСтрока);
	Исключение
		Ответ = API_СлужебныйСервер.Ответ(500, ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция ФормированиеОСВПоСчетуПолучить(Запрос)  
	
	СписокСчетов        = Запрос.ПараметрыЗапроса.Получить("accounts");
	НачалоПериода       = Запрос.ПараметрыЗапроса.Получить("from_date");
	КонецПериода        = Запрос.ПараметрыЗапроса.Получить("to_date");
	КонецПериода        = Запрос.ПараметрыЗапроса.Получить("to_date");
	Организации         = Запрос.ПараметрыЗапроса.Получить("organization");
	ДетализацияСубконто = Запрос.ПараметрыЗапроса.Получить("detail_lvl");
	Субконто1           = Запрос.ПараметрыЗапроса.Получить("subconto_1");
	Субконто2           = Запрос.ПараметрыЗапроса.Получить("subconto_2");
	Субконто3           = Запрос.ПараметрыЗапроса.Получить("subconto_3");
	ПоказыватьСубСчета  = Запрос.ПараметрыЗапроса.Получить("subAccount");
	
	Если СписокСчетов = Неопределено Тогда
		Ответ = API_СлужебныйСервер.Ответ(400, "Не указан список счетов");
		Возврат Ответ;
	КонецЕсли;
	
	Если НачалоПериода = Неопределено Тогда
		Ответ = API_СлужебныйСервер.Ответ(400, "Не указана дата начала периода");
		Возврат Ответ;
	КонецЕсли;
	
	Если КонецПериода = Неопределено Тогда
		КонецПериода = ТекущаяДатаСеанса();
	Иначе
		КонецПериода = API_СлужебныйСервер.ПреобразоватьСтрокуВДату1С(КонецПериода);
	КонецЕсли;
		
	Если ДетализацияСубконто = Неопределено Тогда
		ДетализацияСубконто = 0;
	Иначе
		Попытка
			ДетализацияСубконто = Число(ДетализацияСубконто);
		Исключение
			ДетализацияСубконто = 0;
		КонецПопытки;
	КонецЕсли;
	
	Если ПоказыватьСубСчета = Неопределено Тогда
		ПоказыватьСубСчета = Ложь;
	ИначеЕсли ПоказыватьСубСчета = "true" Тогда
		ПоказыватьСубСчета = Истина;
	Иначе
		ПоказыватьСубСчета = Ложь;
	КонецЕсли;
	
	Субконто1 = API_СлужебныйСервер.СтрокаПараметровВМассив(Субконто1);
	Субконто2 = API_СлужебныйСервер.СтрокаПараметровВМассив(Субконто2);
	Субконто3 = API_СлужебныйСервер.СтрокаПараметровВМассив(Субконто3);
	
	Организации = API_СлужебныйСервер.СтрокаПараметровВМассив(Организации);
	
	СписокСчетов = API_СлужебныйСервер.СтрокаПараметровВМассив(СписокСчетов);
	СписокСчетов = API_Счета.ПреобразоватьСтрокиСчетаВСсылки(СписокСчетов);
	
	НачалоПериода = API_СлужебныйСервер.ПреобразоватьСтрокуВДату1С(НачалоПериода);
		
	Попытка
		JSONСтрока = API_Счета.ПолучитьОстаткиСчетовJSON(СписокСчетов, НачалоПериода, КонецПериода, Субконто1, 
													     Субконто2, Субконто3, Организации, ПоказыватьСубСчета, ДетализацияСубконто);
		Ответ = API_СлужебныйСервер.Ответ(200, JSONСтрока);
	Исключение
		Ответ = API_СлужебныйСервер.Ответ(500, ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции 

#КонецОбласти

#Область Склады

Функция ПолучениеСпискаСкладовПолучить(Запрос)
	
	ТипыСкладов  = Запрос.ПараметрыЗапроса.Получить("types");
	СписокОтветственных = Запрос.ПараметрыЗапроса.Получить("responsibles");
	
	ТипыСкладов = API_СлужебныйСервер.СтрокаТиповСкладовВМассив(ТипыСкладов);
	СписокОтветственных = API_СлужебныйСервер.СтрокаПараметровВМассив(СписокОтветственных);		
	
	Попытка
		JSONСтрока = API_Склады.ПолучитьСклады(ТипыСкладов, СписокОтветственных);
		Ответ = API_СлужебныйСервер.Ответ(200, JSONСтрока);
	Исключение
		Ответ = API_СлужебныйСервер.Ответ(500, ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

Функция ПолучениеОстатковТоваровНаСкладеПолучить(Запрос)
	
	СписокНазванийСкладов  = Запрос.ПараметрыЗапроса.Получить("stores");
	НоменклатураСписок = Запрос.ПараметрыЗапроса.Получить("nomenclatures");
	СписокАртикулов  = Запрос.ПараметрыЗапроса.Получить("articles");
	Дата  = Запрос.ПараметрыЗапроса.Получить("date");
	
	СписокНазванийСкладов = API_СлужебныйСервер.СтрокаПараметровВМассив(СписокНазванийСкладов);
	НоменклатураСписок = API_СлужебныйСервер.СтрокаПараметровВМассив(НоменклатураСписок);
	СписокАртикулов = API_СлужебныйСервер.СтрокаПараметровВМассив(СписокАртикулов);
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	Иначе
		Дата = API_СлужебныйСервер.ПреобразоватьСтрокуВДату1С(Дата);
	КонецЕсли;
	
	Попытка
		JSONСтрока = API_Склады.ПолучитьОстаткиПоТоварамНаСкладе(СписокНазванийСкладов, НоменклатураСписок, СписокАртикулов, Дата);
		Ответ = API_СлужебныйСервер.Ответ(200, JSONСтрока);
	Исключение
		Ответ = API_СлужебныйСервер.Ответ(500, ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область Контрагенты

Функция ПолучениеСпискаКонтрагентовПолучить(Запрос)
	
	СписокНаименований  = Запрос.ПараметрыЗапроса.Получить("name");
	СписокИННКонтрагента = Запрос.ПараметрыЗапроса.Получить("INN");
	СписокКППКонтрагента  = Запрос.ПараметрыЗапроса.Получить("KPP");
	
	СписокНаименований = API_СлужебныйСервер.СтрокаПараметровВМассив(СписокНаименований);
	СписокИННКонтрагента = API_СлужебныйСервер.СтрокаПараметровВМассив(СписокИННКонтрагента);
	СписокКППКонтрагента = API_СлужебныйСервер.СтрокаПараметровВМассив(СписокКППКонтрагента);
	
	Попытка
		JSONСтрока = API_Контрагенты.ПолучитьКонтрагентов(СписокНаименований, СписокИННКонтрагента, СписокКППКонтрагента);
		Ответ = API_СлужебныйСервер.Ответ(200, JSONСтрока);
	Исключение
		Ответ = API_СлужебныйСервер.Ответ(500, ОписаниеОшибки());
	КонецПопытки;	

	Возврат Ответ;
КонецФункции

Функция ПолучениеСпискаРасчетовСКонтрагентамиПолучить(Запрос)
	
	СписокКонтрагентов  = Запрос.ПараметрыЗапроса.Получить("parties");
	НачалоПериода = Запрос.ПараметрыЗапроса.Получить("from_date");
	КонецПериода  = Запрос.ПараметрыЗапроса.Получить("to_date");
	
	СписокКонтрагентов = API_СлужебныйСервер.СтрокаПараметровВМассив(СписокКонтрагентов);
	
	Если НачалоПериода = Неопределено Тогда
		Ответ = API_СлужебныйСервер.Ответ(400, "Не указана дата начала периода");
		Возврат Ответ;
	КонецЕсли;
	
	НачалоПериода = API_СлужебныйСервер.ПреобразоватьСтрокуВДату1С(НачалоПериода);
	
	Если КонецПериода = Неопределено Тогда
		КонецПериода = ТекущаяДатаСеанса();
	Иначе
		КонецПериода = API_СлужебныйСервер.ПреобразоватьСтрокуВДату1С(КонецПериода);
	КонецЕсли;
	
	Попытка
		JSONСтрока = API_Контрагенты.ПолучитьРасчетыСКонтрагентами(СписокКонтрагентов, НачалоПериода, КонецПериода);
		Ответ = API_СлужебныйСервер.Ответ(200, JSONСтрока);
	Исключение
		Ответ = API_СлужебныйСервер.Ответ(500, ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область Прочее

Функция ЗадачиПолучить(Запрос)
	
	Попытка
		JSONСтрока = API_Показатели.ПолучитьЗадачи();
		Ответ = API_СлужебныйСервер.Ответ(200, JSONСтрока);
	Исключение
		Ответ = API_СлужебныйСервер.Ответ(500, ОписаниеОшибки());
	КонецПопытки;	

	Возврат Ответ;
КонецФункции

#КонецОбласти


Функция ПолучениеПоказателейМонитораРуководителяПолучить(Запрос)
	
	Попытка
		JSONСтрока = API_Показатели.ПоказателиМонитораРуководителя();
		Ответ = API_СлужебныйСервер.Ответ(200, JSONСтрока);
	Исключение
		Ответ = API_СлужебныйСервер.Ответ(500, ОписаниеОшибки());
	КонецПопытки;

	Возврат Ответ;
	
КонецФункции

Функция ОбновитьПоказателиМонитораРуководителяЗапустить(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = МониторРуководителя.ЗапуститьОбновлениеМонитораДляВнешнегоПрограммногоИнтерфейса();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Результат = Неопределено Тогда
		// Фоновое задание запущено ранее и все еще выполняется.
		Ответ = Новый HTTPСервисОтвет(202);
	Иначе
		// Фоновое задание запущено.
		Ответ = Новый HTTPСервисОтвет(200);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
#КонецОбласти
